Revit 2024 API
ModelPathUtils Members
The ModelPathUtils type exposes the following members.
Methods
Name | Description
ConvertCloudGUIDsToCloudPath
 Converts a pair of cloud project and model GUIDs to a valid cloud path.
ConvertModelPathToUserVisiblePath
 Gets a string version of the path of a given ModelPath.
ConvertUserVisiblePathToModelPath
 Converts a user-visible path (string) to a ModelPath.
IsValidUserVisibleFullServerPath
 Determines whether the given string represents a valid server path.
Properties
Name | Description
CloudRegionEMEA
 The name of cloud region EMEA.
CloudRegionUS
 The name of cloud region US.
See Also
ModelPathUtils Class
Autodesk.Revit.DB Namespace